In [17]:
#  Sorting and subsetting

import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 40, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   40  Los Angeles
2  Charlie   35      Chicago

In [19]:
df.sort_values("City")

      Name  Age         City
2  Charlie   35      Chicago
1      Bob   40  Los Angeles
0    Alice   25     New York

In [21]:
df.sort_values("City", ascending=False)

      Name  Age         City
0    Alice   25     New York
1      Bob   40  Los Angeles
2  Charlie   35      Chicago

In [33]:
df.sort_values(["City","Age"])

      Name  Age         City
2  Charlie   35      Chicago
1      Bob   40  Los Angeles
0    Alice   25     New York

In [29]:
df.sort_values(["City","Age"],ascending=[True,False])

      Name  Age         City
2  Charlie   35      Chicago
1      Bob   40  Los Angeles
0    Alice   25     New York

In [31]:
# substting column
df['City']

0       New York
1    Los Angeles
2        Chicago
Name: City, dtype: object

In [39]:
# substting multiple columns
df[['City','Age']]

          City  Age
0     New York   25
1  Los Angeles   40
2      Chicago   35

In [41]:
df["Age"]>35

0    False
1     True
2    False
Name: Age, dtype: bool

In [49]:
df[df["Age"]>35]

  Name  Age         City
1  Bob   40  Los Angeles

In [45]:
df[df["City"]=="New York"]

    Name  Age      City
0  Alice   25  New York

In [47]:
df[df["Age"]<38]

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [55]:
df[(df["Age"]==35) &(df["City"]=="New York")]

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [57]:
df[(df["Age"]==25) &(df["City"]=="New York")]

    Name  Age      City
0  Alice   25  New York

In [65]:
is_25_or_35 = df["Age"].isin([25,35])

In [67]:
print(df[is_25_or_35])

      Name  Age      City
0    Alice   25  New York
2  Charlie   35   Chicago

In [69]:
# # Sort homelessness by region, then descending family members
# homelessness_reg_fam = homelessness.sort_values(["region","family_members"],ascending=[True,False])

# # Print the top few rows
# print(homelessness_reg_fam.head())

In [71]:
# # Select only the individuals and state columns, in that order
# ind_state = homelessness[["individuals","state"]]

# print(ind_state.head())

In [73]:
# # Filter for rows where family_members is less than 1000 
# # and region is Pacific
# fam_lt_1k_pac = homelessness[(homelessness["family_members"]<1000) & (homelessness["region"]=="Pacific")]

# # See the result
# print(fam_lt_1k_pac)

In [75]:
# # The Mojave Desert states
# canu = ["California", "Arizona", "Nevada", "Utah"]

# # Filter for rows in the Mojave Desert states
# mojave_homelessness =homelessness[ homelessness["state"].isin(canu)
# ]
# # See the result
# print(mojave_homelessness)